package app5_제어문;

public class class_0111_7_클래스 {
	/*
	 *  	객체지향 프로그래밍 언어 (Object Oriented Programming)
	 *  	==> 객체 개념을 이용해서 프로그래밍 한다.
	 *  
	 *  1. 객체(Object)?
	 *  ==> 주체(subject)가 바라본 사물 의미
	 *  
	 *  2. 객체는 2가지 요소를 가진다
	 *  	가. 속성
	 *  	나. 동작
	 *  
	 *  예> 모니터 객체
	 *  	속성
	 *  		- 색상
	 *  		- 크기
	 *  		- 가격
	 *  	동작
	 *  		- on
	 *  		- off
	 *  
	 *  3. 자바 어플리케이션 개발 프로세스
	 *  
	 *  	분석 --> 설계 --> 구현 --> 테스트 --> 배포
	 *  
	 *  분석 : 객체 추출 ( 어플리케이션 개발에 적합한 객체를 추출)
	 *  	예> 학생관리 프로그램 개발
	 *  		- 학생 객체
	 *  			속성: 학번, 이름, 주소, ...
	 *  			동작: 공부하기, ...
	 *  		- 성적객체
	 *  		- 교사객체
	 *  
	 * 	설계 : 분석단계에서 추출한 객체를 클래스로 변환해서 표현
	 * 			(현실세계 개념) ================> (가상세계)
	 * 							OOP 프로그래밍
	 * 		예>
	 * 			- 학생객체 ====> Student 클래스 ====> 객체생성(new) ===> 인스턴스(메모리에 올라간 것)
	 * 
	 * 				속성 : 학번,이름,주소.... 	===> 변수
	 * 				동작 : 공부하기,...		===> 메소드
	 * 			
	 * 
	 * 						클래스역할(틀, 설계도) ==============> 인스턴스
	 * 					예>		붕어빵틀			============> 실제 붕어빵
	 * 	
	 * 		** 용어 정리 **
	 * 		가. 객체(Object)	: 현실세계의 사물을 의미
	 * 		나. 클래스		: 객체의 자바 표현방법 (틀, 설계도)
	 * 		다. 인스턴스		: 메모리에 생성된 실체 (객체라고도 부른다)
	 * 
	 * 
	 */
}
